In [1]:
# importing dependencies
import pandas as pd
from sqlalchemy import create_engine

In [5]:
# reading in csv data
salaries_file = "../Resources/Salaries.csv"
salaries_raw_df = pd.read_csv(salaries_file)

teams_file = "../Resources/Teams.csv"
teams_raw_df = pd.read_csv(teams_file)

teams_fran_file = "../Resources/TeamsFranchises.csv"
teams_fran_raw_df = pd.read_csv(teams_fran_file)

master_file = "../Resources/Master.csv"
master_players_raw_df = pd.read_csv(master_file)

In [4]:
# previewing the salaries df 
# ["yearID","teamID","lgID","playerID","salary"]
salaries_raw_df.head(5)

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [6]:
# previewing the teams df 
# ['yearID', 'lgID', 'teamID', 'franchID', 'divID', 'Rank', 'G', 'Ghome', 'W', 'L', 'DivWin', 'WCWin', 'LgWin', 'WSWin', 'R', 'AB', 'H', '2B', '3B', 'HR', 'BB', 'SO', 'SB', 'CS', 'HBP', 'SF', 'RA', 'ER', 'ERA', 'CG', 'SHO', 'SV', 'IPouts', 'HA', 'HRA', 'BBA', 'SOA', 'E', 'DP', 'FP', 'name', 'park', 'attendance', 'BPF', 'PPF', 'teamIDBR', 'teamIDlahman45', 'teamIDretro

teams_raw_df.head(5)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
0,1871,NaN,BS1,BNA,NaN,3,31,NaN,20,10,...,NaN,0.83,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NaN,CH1,CNA,NaN,2,28,NaN,19,9,...,NaN,0.82,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NaN,CL1,CFC,NaN,8,29,NaN,10,19,...,NaN,0.81,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NaN,FW1,KEK,NaN,7,19,NaN,7,12,...,NaN,0.80,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NaN,NY2,NNA,NaN,5,33,NaN,16,17,...,NaN,0.83,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2

In [7]:
# previewing the teamsfranchises df 
# ['franchID', 'franchName', 'active', 'NAassoc]

teams_fran_raw_df.head(5)

  franchID                     franchName active NAassoc
0      ALT          Altoona Mountain City      N     NaN
1      ANA  Los Angeles Angels of Anaheim      Y     NaN
2      ARI           Arizona Diamondbacks      Y     NaN
3      ATH         Philadelphia Athletics      N     PNA
4      ATL                 Atlanta Braves      Y     BNA

In [9]:
# previewing the Master df 
# ['playerID', 'birthYear', 'birthMonth', 'birthDay', 'birthCountry', 'birthState', 'birthCity', 'deathYear', 'deathMonth', 'deathDay', 'deathCountry', 'deathState', 'deathCity', 'nameFirst', 'nameLast', 'nameGiven', 'weight', 'height', 'bats', 'throws', 'debut', 'finalGame', 'retroID', 'bbrefID]

master_players_raw_df.head(5)

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,220.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [11]:
# transformation of salaries_raw_df
# ["yearID","teamID","lgID","playerID","salary"] - old column names

salaries_df_2 = salaries_raw_df.copy()
salaries_df_3 = salaries_df_2.rename(columns = {"yearID" : "year","lgID" : "leagueID"})

In [13]:
salaries_df_3

       year teamID leagueID   playerID    salary
0      1985    ATL       NL  barkele01    870000
1      1985    ATL       NL  bedrost01    550000
2      1985    ATL       NL  benedbr01    545000
3      1985    ATL       NL   campri01    633333
4      1985    ATL       NL  ceronri01    625000
...     ...    ...      ...        ...       ...
25570  2015    WAS       NL  treinbl01    512800
25571  2015    WAS       NL  ugglada01    507500
25572  2015    WAS       NL  werthja01  21000000
25573  2015    WAS       NL  zimmejo02  16500000
25574  2015    WAS       NL  zimmery01  14000000

[25575 rows x 5 columns]

In [ ]:
# reindexing salaries df to merge with master player df